Revit 2027 API
CriticalPathIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual MEPNetworkSegmentId Current { get; }
Public Overridable ReadOnly Property Current As MEPNetworkSegmentId
	Get
public:
virtual property MEPNetworkSegmentId^ Current {
	MEPNetworkSegmentId^ get ();
}
abstract Current : MEPNetworkSegmentId with get
override Current : MEPNetworkSegmentId with get
Property Value
MEPNetworkSegmentId
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
CriticalPathIterator Class
Autodesk.Revit.DB.Analysis Namespace